<template>
  <div class="container m-auto">
    <div class="component-article">
      <div class="title">
        常見問題Q&A
      </div>
      <div class="title-second">
        問題分類
      </div>
      <ol class="ordered-list">
        <li>ㄧ、儲值問題</li>
        <li>二、白鑽問題</li>
        <li>三、帳號問題</li>
        <li>四、操作問題</li>
        <li>五、故障排除</li>
        <li>六、其它問題</li>
      </ol>
      <div class="title-second">
        一、儲值問題
      </div>
      <collapse
        title="1.請問我能透過哪些管道儲值點數?"
        body="A:首先感謝您對本平台的支持與愛護。目前您可以利用網銀及超商條碼進行點數的儲值，平台正努力開發其它儲值的管道，未來將可以提供更多元更便捷的方式來為您服務，敬請拭目以待。"
      />
      <collapse
        title="2.如果我儲值，萬一儲值失敗怎麼辦?(我明明儲值了，卻沒看到點數)"
        body="A:您可以在個人網頁中「我的錢包」檢視自己的點數是否有增加，在「我的錢包」當中，您可以清楚看到每次的儲值紀錄。若您發現「我的錢包」內並無本次儲值記錄，也沒有增加個人可使用的點數，即代表這次儲值未成功，請放心!儲值沒有完成的情況下，是不會有任何帳務產生的。若您在進行以上步驟之後尚有任何問題，可以在「連絡我們」的選項中告知官方，我們會協助您確認本次儲值狀況及內容。"
      />
      <collapse
        title="3.我可以使用別人的帳號儲值嗎?"
        body="A:在這裡提醒您，為避免使用他人帳號消費所衍生出的糾紛及法律責任，請您千萬不要使用別人的帳號進行儲值，若因此產生任何問題，本平台將不負任何責任。"
      />
      <collapse
        title="4.儲值可以直接帳戶扣款嗎?"
        body="A:您可以用Web ATM網銀的儲值方式，或是您也可以使用超商條碼儲值，兩種方式都很便捷。"
      />
      <div class="title-second">
        二、白鑽問題
      </div>
      <collapse
        title="1.請問我可以利用白鑽做什麼?"
        body="A:您所擁有的白鑽可以在本平台內與所喜愛的貴妃聊天，本站往後還會其他的虛擬點數推出，有配合商城功能的虛擬點數，本站增加其他虛擬點數後也能選購喜愛的周邊商品及參與未來平台不定時所舉辦的各式活動。"
      />
      <collapse
        title="2.我可以將白鑽轉讓給其他人嗎?"
        body="A:本平台所有用戶的白鑽是不可以轉移到其他用戶的喔!更不能夠透過第三方進行白鑽的買賣，所有利用非官方渠道所獲得白鑽進行操作的行為，皆有觸法之虞，所以希望您為保護自身權益，絕對不要使用不被認可的方式來獲得白鑽喔!"
      />
      <collapse
        title="3.白鑽若用不完，可以退回換現金嗎?"
        body="A:您個人帳戶的白鑽是不能夠退回換現金的喔!所以希望您能妥善地利用您所擁有的白鑽，本平台未來也會陸續推出許多精采的活動及精緻的周邊商品，絕對會讓您感受到物超所值，敬請期待!"
      />
      <collapse
        title="4.若太久沒上線，白鑽是否會消失?"
        body="A:為維護所有用戶的上線品質，若該帳號24個月未上線，本平台將會刪除該帳號內一切資料，包含其個人資訊、白鑽及您在本站購買的其他虛擬點數。因此，還請您多多上線，別忘了還有許許多多優質的貴妃等著您上線，一同開啟令人回味無窮的體驗。"
      />
      <collapse
        title="5.若聊到一半發現沒白鑽了該怎麼辦?"
        body="A:請您放心!一旦您要續聊白鑽卻不足時，系統會提前通知您目前的白鑽已不足，請您再到商城儲值，讓您可以更游刃有餘地接續這段與心儀貴妃的美好邂逅!"
      />
      <collapse
        title="6.我要怎麼看還剩多少白鑽?"
        body="A:網頁內有一個「我的錢包」，您可以在裡面看到您目前的白鑽餘額以及之前的儲值記錄。"
      />
      <collapse
        title="7.萬一白鑽無故減少怎麼辦?"
        body="A:請放心，本平台的工程部門會嚴謹地為您的帳戶安全把關。若您真的對您的點數有疑問，可以在「連絡我們」的選項中向官方回報，我們會立即為您確認相關細節。"
      />
      <div class="title-second">
        三、帳號問題
      </div>
      <collapse
        title="1.請問一個人可以開幾個帳號?"
        body="A:為維護平台所有用戶的公平性，一位用戶只能創辦一個帳號，若用戶多開帳號被本站發現，本站會刪除您的其他帳號，若造成用戶損失，用戶須自行承擔。"
      />
      <collapse
        title="2.我的帳號可以借別人使用嗎?"
        body="A:提醒您，千萬不要將您的帳號交予他人使用，因為您的帳號內不但有您個人才能使用的點數，同時更有您和貴妃過往互動的訊息在裡面，一旦您將帳號交予他人使用，不只代表著別人將有一窺您私密的機會，他人利用您帳號所做的事和說的話，本平台都將視為是您本人所為，所以為保護您自身的權益，千萬不要將帳號借給他人使用，若發現用戶帳號供他人使用會遭到本站停權且帳號內的點數不予退還，嚴重可能會涉及相關法律問題，用戶須自行承擔責任。"
      />
      <collapse
        title="3.我的帳號可以變更基本資料嗎?"
        body="A:您可以隨時變更基本資料，但提醒用戶，本站不鼓勵用戶使用假資料，原因在於若用戶冒用他人資料，或不實資料， 損害本站或是損害到他人利益，用戶須自行承擔延伸性法律問題。"
      />
      <collapse
        title="4.我忘記帳號密碼了怎麼辦?"
        body="A:用戶在登入本站的視窗中，有一個選項是忘記密碼的選項，您可以依循『忘記密碼』內的操作流程找到您的密碼。"
      />
      <div class="title-second">
        四、操作問題
      </div>
      <collapse
        title="1.我可以同時和兩位以上的貴妃聊天嗎?"
        body="A:用戶能同時與許多貴妃聊天，但提醒用戶與一位貴妃聊天半小時是消費100鑽，若同時與兩位貴妃就是200鑽，以此類推。"
      />
      <collapse
        title="2.聊到一半不小心關閉網頁或網路斷線怎麼辦?"
        body="A:用戶不用擔心，若您不小心關閉網頁或是斷線，您再趕緊恢復網路上線就可以繼續與貴妃聊天了，但提醒您在您斷線的這段時間，您與貴妃的聊天時間依樣會持續計算，所以建議您在網路穩定的地方與貴妃開通聊天。"
      />
      <collapse
        title="如果我當次聊天的時間未滿30分鐘該如何計費?"
        body="A:用戶與一位貴妃聊天消費100鑽用戶能與貴妃聊天30分鐘，若用戶只聊了20分鐘就離開，還是以100鑽計，本站是先扣100鑽用戶才能與貴妃聊天，每次的聊天時間也沒有累計到下一次的機制，所以建議用戶在充裕的時間下開通與貴妃聊天。"
      />
      <collapse
        title="如果跟貴妃只聊一下，想換跟另一位貴妃聊，是否會重新計費?"
        body="A:是的！因為每一次與各個貴妃聊天都是要消費100鑽，每一次消費的100鑽都只能用在此次的貴妃與此次聊天的30分鐘內。"
      />
      <collapse
        title="如果聊到一半貴妃要下線了怎麼辦?"
        body="A:用戶放心，若用戶選擇了與本站的某位貴妃聊天，此貴妃不會突然下線，若是斷線的問題，此貴妃也會儘速恢復網路並上線繼續與用戶暢談。"
      />
      <div class="title-second">
        五、故障排除
      </div>
      <collapse
        title="1.網頁如果一直打不開怎麼辦?(或是無法登入)"
        body="A:用戶若發現此問題，用戶能先檢查您的網路是否有問題，若無問題可能是本站正在維護，建議您可以稍待片刻或是搜尋本站的ＦＢ粉專或ＩＧ、官網做詢問。"
      />
      <collapse
        title="2.我想回看之前的聊天記錄可以嗎?"
        body="A:用戶的歷史紀錄會紀錄七天或是五百則，若用戶與心儀的貴妃七天未開通的話歷史訊息會消失，或是用戶與貴妃聊天的則數超過五百則，舊的訊息會消失，用戶可以多上線與您心儀的貴妃聊天，這樣可以持續保留歷史訊息。"
      />
      <collapse
        title="3.我忘記上次和哪一位貴妃聊天了怎麼辦?"
        body="A:用戶可以在用戶個人資訊裡『近期聊天貴妃』的功能內，找到之前您心儀的貴妃。"
      />
      <collapse
        title="4.為什麼我一直無法和貴妃聊天?"
        body="A:用戶無法跟貴妃聊天，您可以點自己的資訊，裡面有儲值的功能，要請用戶先儲值才能與貴妃聊天，若用戶已經有儲值點數，可能要注意一下網路是否正常運作。"
      />
      <collapse
        title="5.為什麼我的對話框一直都是灰色的?"
        body="對話框如果是灰色的，有三種狀況。
              1、用戶與此貴妃的聊天時段已經結束了。
              2、貴妃已經下線了，您可以選擇與其他貴妃聊天。
              3、用戶的點數不足無法與貴妃聊天，請用戶再儲值點數後開通與貴妃聊天"
      />
      <div class="title-second">
        六、其它問題
      </div>
      <collapse
        title="1.我怎麼確定和我聊天的是貴妃本人?"
        body="A:請用戶放心，本站對於貴妃的要求非常嚴格，若貴妃把帳號給其他人使用，被公司發現是會除名的，我們都會不定期的增加貴妃與說明會，增加對貴妃的教育訓練，要求貴妃一定要本人親自回覆。"
      />
      <collapse
        title="2.我可以和心儀的貴妃見面嗎?"
        body="A:本平台已經在著手安排許多不同形式的見面會，請您再多等一下下，等活動隆重推出之後，一定會讓您有一親芳澤的機會，敬請期待!"
      />
      <collapse
        title="3.聊天中發生了令人不舒服的對話怎麼辦?"
        body="A:若您真的遇到了不舒服的體驗，請您利用「連絡我們」的選項，向官方告知過程的內容及細節，我們將會調閱您與貴妃的交談記錄來加以判別，若經官方查證確為貴妃的疏失或過錯而讓您產生不愉快的體驗，我們除了對該貴妃會處以適當的懲處之外，情節嚴重者將與其解約，立即中止雙方合作關係；情節較輕者，也會對該貴妃重新教育訓練，請所有用戶放心，本平台定會以負責任的態度來維護所有用戶的權益。"
      />
    </div>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'
import Collapse from '@/components/Collapse.vue'

export default Vue.extend({
  components: {
    Collapse
  },
  layout: 'WithHeaderFooter',
  head: {
    title: '常見問題'
  }
})
</script>
