<template>
  <div class="container m-auto">
    <div class="component-article">
      <div class="title">
        關於我們
      </div>
      <div class="paragraph">
        現今這個社會，由於忙碌的生活步調與科技的快速進步，使得人與人之間的互動，顯得既貧乏又缺少聯繫的機會，因此本平台成立的初衷，就是希望能夠藉由科技，讓認識新朋友這件事，可以善用零碎的時間以及打破地域性的限制，得以滿足我們對豐富人際關係的渴望，更甚者，若能為有婚姻需求的用戶促成一些良姻善緣，我們也是非常樂見的。
      </div>
      <div class="paragraph">
        本平台用大量的資源，致力於打造一個可以隨時隨地與不同的人上線聊天談心的優質環境，我們確保每一個上線聊天的人，一定都是真人，絕無機器代聊，亦對貴妃的要求施以最高標準的汰選。我們以用戶體驗的感受為唯一的評分標準，所有用戶不滿意的部份，我們都會用心改進；所有用戶希望優化的功能，我們也願意不計成本地儘可能加強，這一切的努力，都是希望所有的用戶都能夠在本平台得到最妙不可言的體驗感受。
      </div>
      <div class="paragraph">
        我們也期許能夠與所有的用戶更直接地交流與互動，因此本平台特別在 Fb 及 Ig 創立了粉絲專頁，並用心經營本平台直接對外界的官方 Line 帳號，希望藉由以上這些管道，可以讓用戶得到最佳的反饋及最完善的問題處理流程，更重要的是，本平台所有貴妃的最新資訊及各式各樣最新的活動辦法，也將會是由以上的管道優先發佈，以下是各粉絲專頁及官方Line,歡迎各位的關注。
      </div>
      <div class="paragraph">
        最後，本平台所有工作人員感謝您的參與，也衷心祝福您能夠在本平台尋得一位知心好友，為您的精神生活注入一道溫暖心扉的力量，讓各位的心靈得到最大的滿足，謝謝您的使用，謝謝。
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'

export default Vue.extend({
  layout: 'WithHeaderFooter',
  head: {
    title: '關於我們'
  }
})
</script>
