<template>
  <div class="container m-auto">
    <div class="component-article">
      <div class="title">
        關於我們
      </div>
      <div class="title-second">
        服務條款
      </div>
      <div class="paragraph">
        歡迎您加入成為SweetRing會員（以下稱"會員"）， SweetRing係由『思維特網路資訊有限公司』所建置提供，包括但不限於ios版、Android版等，由思維特網路資訊有限公司所推出於各式設備裝置上的相關版本（以下稱「本站」），您如提出申請並註冊使用本站，即表示您已閱讀、理解並完全同意接受下列說明及本站一切內容，您如有違反下列說明或本站任一內容時，為確保本站善良風氣及維護網友權益，本站得隨時暫停或終止您使用本站所提供之服務
      </div>
      <div class="title-second">
        一、認知與接受條款
      </div>
      <div class="paragraph">
        您在使用本站提供的各項服務之前，應仔細閱讀本服務條款。如您不同意本服務條款及或隨時對其的修改，或者您所屬的國家或地域排除本服務條款內容之全部或一部份時，您應立即停止使用本服務；您一旦註冊成為SweetRing會員，當您使用SweetRing服務時，即視為您已閱讀、理解並完全同意接受本服務條款及其後續修改變更之各項內容。
      </div>
      <div class="title-second">
        二、服務說明與管理規範
      </div>
      <div class="paragraph">
        本站目前經由其產品組合，向用戶提供豐富的網上資源與諸多服務，包括各種資訊工具、訊息服務、個人化內容及品牌程式設計（以下稱"本服務"）。除非本服務條款另有其他明示規定，增加或強化目前本服務的任何新功能，包括所推出的新產品，均受到本服務條款之規範。您瞭解並同意，本服務僅依其當前所呈現的狀況提供，對於任何用戶通訊或個人化設定之時效、刪除、傳遞錯誤、未予儲存或其他任何問題，SweetRing均不承擔任何責任。SweetRing保留不經事先通知為維修保養、升級或其他目的暫停本服務任何部分的權利。為使用本服務，您必須能夠自行經有法律資格對您提供網路服務的第三方，進入網際網路，並應自行支付相關服務費用。此外，您必須自行配備及負責與網路連接所需之一切必要裝備，包括電腦或其他儲存器材。
      </div>
      <ol class="ordered-list">
        <li class="list-item">
          未滿12歲網友不宜瀏覽本站內容，12歲以上未滿18歲的網友需父母或師長輔導瀏覽，且本站不提供未滿18歲網友註冊會員，滿18歲但未滿20歲的網友，請依上述說明取得您的法定代理人（或監護人）同意，始可註冊與使用本站。
        </li>
        <li class="list-item">
          嚴禁任何人利用本站從事色情交易或任何違反中華民國法律法令規定的不法行為。若涉有不法行為或色情交易者，除應由行為或交易當事人自負法律責任外，本站得依法協助檢調單位調查蒐證。無論暱稱、自我介紹、聊天等在本站可公開瀏覽或私下傳遞的資訊，只要有色情交易或援助交際、伴遊等暗示性字眼，經其他會員向管理員檢舉後，本站將直接予以永久停權封鎖信箱的處分並立刻執行。關於內容的解讀，由本站管理單位從嚴判定，並擁有最終之決定權限，因此請使用者自重，切勿使用任何可能讓人誤會的字眼。
        </li>
        <li class="list-item">
          嚴禁任何人利用本站各項功能進行性邀約活動，性邀約認定項目包括但不限於下列行為：徵求一夜情、色情視訊、電愛、網愛、情婦（夫）徵求等。關於內容的解讀，由SweetRing管理單位從嚴判定，因此請使用者勿使用任何可能讓人誤會的字眼。
        </li>
        <li class="list-item">
          會員間私人糾紛請自行協調溝通，不得使用暱稱、自我介紹、聊天室聊天等公開供不特定人瀏覽觀看的方式，公佈提及他人真實姓名、住址、電話…等洩漏足以讓第三者認出對方之個人資料、或侵害他人隱私之內容或文章、或發表危害毀損他人名譽的內容，若因此導致引起任何法律問題，除請自負法律責任外，本站得依法協助檢調單位調查蒐證。
        </li>
      </ol>
    </div>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'

export default Vue.extend({
  layout: 'WithHeaderFooter',
  head: {
    title: '關於我們'
  }
})
</script>
