<template>
  <div class="container m-auto">
    <div class="component-article">
      <div class="title">
        服務條款
      </div>
      <div class="paragraph">
        親愛的會員們大家好，歡迎來到最優質的聊天平台，為維持平台的優質環境，以下我們訂定了使用平台規範，所有會員加入平台前都應詳閱平台規範後使用平台。冰山撞甜心聊天平台以下稱「本站」
      </div>
      <div class="paragraph">
        若有違反本站所訂定之使用規範或是以下任一內容時，本站得暫停或是終止您使用本站之權利與服務，以利維持平台穩健與其會員之權利，敬請所有會員配合與遵守，本站在此感謝所有會員。
      </div>
      <div class="title-second">
        名詞定義
      </div>
      <div class="paragraph">
        冰山撞甜心平台稱「本站」
      </div>
      <div class="paragraph">
        冰山撞甜心平台會員稱「會員」
      </div>
      <div class="paragraph">
        經本站商城購買之虛擬幣稱「白鑽」
      </div>
      <div class="paragraph">
        一、本站僅接受年滿十八歲之人成為會員。會員應如實告知本站真實年齡，不得有隱匿年齡之情事。若有隱匿之情事經查證，本站有權終止您的會員資格，且停止您在平台的一切權限，若您白鑽等虛擬幣並不得請求返還。
      </div>
      <div class="paragraph">
        二、會員需為具完全行為能力的自然人。若會員為限制行為能力人，註冊成為本站會員前應由其法定代理人閱讀、了解並同意本站的平台使用規範及其他服務條款之約定的所有內容及其修改後的內容。會員並聲明，已於註冊前取得法定代理人閱讀了解並同意本站訂定之條款內容與服務。
      </div>
      <div class="paragraph">
        三、會員註冊後取得本站的帳號與密碼僅供會員本人使用，該帳號不得轉讓、贈與或繼承，若會員決定不再使用本會員註冊之帳號時，應向本站提出註銷帳號申請。註銷帳號視同終止帳號，且日後不得再註冊本站其他帳號，白鑽等虛擬幣均不得請求返還。
      </div>
      <div class="paragraph">
        四、本站會員應遵守下列規定，否則本站得終止本契約，停止該會員在本站的所有權利與義務及服務。有以下任一情事，本站得不同意加入會員：
      </div>
      <ol class="ordered-list">
        <li>1、以他人名義申請。</li>
        <li>2、申請服務時，登錄資料不實。</li>
        <li>3、未滿十八歲或不具完全行為能力者</li>
        <li>4、曾因違反本站平台使用規範或因其他原因被停權者。</li>
        <li>5、因本站或本公司因策略或其考量</li>
        <li>6、其他</li>
      </ol>
      <div class="paragraph">
        五、會員需善盡帳號及密碼保密與妥站保管之義務，不得以有償或無償之方式透露給第三方登陸使用，任何經由輸入該帳號及密碼所產生的交易行為、活動，均視為該初始帳號註冊之會員的個人行為，經由該帳號及密碼所產生之所有行為，應由該帳號及密碼初始註冊之人自負其責任。
      </div>
      <div class="paragraph">
        六、會員應如實填寫基本資料，不得填寫他人資料、或盜用、借用他人之資料或照片。若有填寫不實資料或使用非本人照片之情事，經本站發覺或經第三人檢舉屬實，本站有權終止會員帳號。若有損壞或造成平台損失，須負損害賠償責任，包括但不限於律師費用及執行費用。且冒用人須自行承擔冒用個資之所有民刑事法律責任，概與本站無涉。
      </div>
      <div class="paragraph">
        七、會員間若有糾紛、不悅、爭執，應自行協調，請會員雙方自行溝通，不得使用暱稱、自我介紹、公告、照片、聊天室聊天、訊息、直播、視訊或其他網入社群平台公開，供不特定人士瀏覽觀看。若會員公布其他會員真實姓名、地址、電話、或其他不特定人士個人資料、侵害他人隱私、詆毀他人名譽或有其他違法或侵害他人權利之情事，應自負相關法律責任，概與本站無涉，本站將依有權之司法、警察機關之要求提供相關資料。
      </div>
      <div class="paragraph">
        八、為確保所有帳號的使用權益，本站禁止一人申請數個帳號。且為確保帳號真實性，若會員兩年沒有登錄帳號，本站會因爲休眠狀態而刪除會員的帳號，即終止與會員之契約，會員就儲值之白鑽等虛擬幣、獲得之其他紅利等均不得請求返還獲賠償。
      </div>
      <div class="paragraph">
        九、本站若發現疑似曾經遭本站終止帳號之人，於本站重新創立新帳號，本站有權終止此會員帳號。終止契約後，會員就儲值之白鑽等虛擬幣、獲得之其他紅利等均不得請求返還獲賠償。
      </div>
      <div class="paragraph">
        十、會員之間不得有衝突、言語衝突、言語攻擊、言語挑釁、人身攻擊、騷擾其他會員，或其他任何讓其他會員不舒服之情事，亦不得教唆他人對其他會員為上述行為。若有前揭行為經查證屬實，本站有權終止契約。終止契約後，會員就儲值之白鑽等虛擬幣、獲得之其他紅利等均不得請求返還獲賠償。
      </div>
      <div class="paragraph">
        十一、本站嚴禁會員使用色情、性暗示、性攻擊、猥褻、不雅、變態、骯髒或其他任何會讓人不舒服之言語，進行聊天行為。若經本站發覺或經檢舉，查證屬實，本站有權暫停您的平台使用權限，在此請所有會員在用詞上謹言慎行
      </div>
      <div class="paragraph">
        十二、本站嚴禁私約、任何性邀約活動，包括：一夜情、視訊性愛、色情視訊、色情電話聊天、徵求包養、徵求性伴侶、徵求情婦（夫）、性愛派對及其他未提及之所有色情活動、性愛活動。本站保留認定情事之權利，若發現或遭舉發有以上情事，本站得暫停或終止會員權限之權利，請會員在所有行為前三思後行
      </div>
      <div class="paragraph">
        十三、本站保有更改平台選項、內容、服務之權利，且自本站更新公告後生效，不需另行通知會員。會員應自行留意本站之公告，所有會員在第一次勾選同意平台使用規範條款後視同同意爾後本站的所有更改選項、內容、服務。如有不同意本站相關條款之修正，會員應通知本站終止契約，否則即視為同意。
      </div>
      <div class="paragraph">
        十四、本站不會以電話指示會員操作ATM、提供提款卡及密碼。如會員接獲自稱為本站人員，要求會員為上述行為，極有可能是詐騙集團所為，請撥打165專線查證。本站會員應自行加強警覺，如遇到詐騙之情事，本站不負責任。在此提醒所有本站使用者，進行任何行為前請三思後行且小心謹慎查證事件是否屬實
      </div>
      <div class="paragraph">
        十五、本站嚴禁散布、播送或販賣，或公然陳列，或以他法供人觀覽、聽聞猥褻之文字、圖畫、聲音、影像或其他物品，包括但不限於本人或他人裸照、色情照片、不雅照片、性愛照片或其他任何客觀上須足以引起他人性慾，在主觀上足以滿足自己情慾之物品。若有以上情事，經本站發覺或是經他人檢舉，查證屬實，本站有權暫停或終止相關人等之平台使用權利，並應由會員自負法律責任。
      </div>
      <div class="paragraph">
        十六、本站不保證本站內的任何資訊、資料、文字、照片、圖型、軟體、音樂、訊息、信息或其他資料之準確性與可靠性，上述內容本公司不會為任何資訊不實、錯誤、疏忽負上責任。
      </div>
      <div class="paragraph">
        十七、會員不得以本站內的任何系統錯誤、服務暫停或終止、保安漏洞為由，向本站請求賠償或是要求退款。
      </div>
      <div class="paragraph">
        十八、本站提醒會員，使用本站服務需在網路順暢的情況下使用，會員應自行準備完善設備及網路連線後，再使用本站聊天、商城儲值、瀏覽及其他服務
      </div>
      <div class="paragraph">
        十九、本站嚴禁所有的行銷行為，或非經本站之授權而招攬其他會員之行為，包括：直銷、保險、經紀、股票、酒店、按摩、美容、八大、所有金融業務及所有買賣行為。若發現有會員有以上行為之推廣、介紹或是發文，本站有權暫停或終止會員使用權限、並終止與會員間之契約。
      </div>
      <div class="paragraph">
        二十、本站嚴禁所有會員與所有使用本站平台之其他使用者有私下交易之行為，且不得誘導任何人私下交易。本站所提供之白鑽等虛擬幣必須為本站提供之商城購買之正常途徑所購買之白鑽等虛擬幣，若有發現使用者會員私下交易之行為，或使用非本站提供之商城購買的白鑽等虛擬幣者，本站有權終止會員帳號且沒收所有白鑽等虛擬幣之權利。
      </div>
      <div class="paragraph">
        二一、承上，平台使用規範所稱「之本站提供商城購買之白鑽等虛擬幣」，係指符合以下操作程序取得之白鑽等虛擬幣：使用者須先成為正式的本站會員審核後->進入冰山撞甜心平台介面點選商城選項->選取您想要購買的白鑽等虛擬幣額度->確認選項後輸入您本人的信用卡->確認完成交易。僅有以此途徑所購買之白鑽等虛擬幣，方可在本站使用，若有發現使用非本站提供之商城購買的白鑽等虛擬幣之會員，本站有權終止會員帳號且沒收所有白鑽等虛擬幣之權力。
      </div>
      <div class="paragraph">
        二二、本站為優質的聊天平台，若會員發現進入聊天室後有聊天延遲、沒有回覆、文字沒有辦法輸入及未提及之情況，進入聊天室後有任何異狀請儘速向本站回應，本站會儘速幫您處理。
      </div>
      <div class="paragraph">
        二三、本站會員應知曉網路無上線地點限制，故會員除應遵守本站公司所在地台灣之法令外，亦應遵守會員所在地之法律。
      </div>
      <div class="paragraph">
        二四、本公司及本站保有本站應用程式內全部內容的著作權。本站會員上載及發布的所有資訊、文字、音樂、照片、視訊、信息、音訊、資料或其他資料時，即為授權本站以重製、公開口述、公開播送、公開上映、公開演出、公開傳輸、公開展示、改作、散布等方式利用，會員不得有異議，本站也無需通知會員。本站及公司可在任意情事下使用上述本站保留之所有資訊
      </div>
      <div class="paragraph">
        二五、除依本站規定之方式使用本站所提供之服務外，會員不得以任何方式重製本站內的任何資訊、文字、圖片、軟件、音樂、程式、視訊、信息及其他資料。若有會員轉載或事下載之情事，本站得請求損害賠償。
      </div>
      <div class="paragraph">
        二六、本站商城提供的商品並非強制要求會員購買，且在會員購買前可以考慮並思考購買的金額。本商城提供之商品均為「通訊交易解除權合理例外情事適用準則」第2條第5款所規定「非以有形媒介提供之數位內容或一經提供即為完成之線上服務，經消費者事先同意始提供」之服務，依消費者保護法第19條第1項但書規定，不適用七天內無條件解除契約之規定。故會員不得以鑑賞期、試用或其他名義提出退費，本站建議所有用戶在購買前先審慎評估後再進行購買。
      </div>
      <div class="paragraph">
        二七、本站會員不得使用他人信用卡、資金、帳號，購買本站商城商品，若有違反致侵害他人權利，會員應自行負擔相關民刑事法律責任，會員並應返還本平台已交付之商品，並賠償本平台所受之損失。
      </div>
      <div class="paragraph">
        二八、本站不保證會員聊天內容能符合所有會員之期待，在選取付費聊天時請會員三思而後行。所有聊天行為是個人行為，會員經過思考後進入付費聊天，若聊天內容並非會員所滿意，不得要求本站退費。
      </div>
      <div class="paragraph">
        二九、本站所有會員倘有破壞公司信譽、違反刑法、個資法、業務品質管制辦法、其它與網路平台相關法令、辦法或本合約書者，本站得終止契約，停止會員平台使用之權利。
      </div>
      <div class="paragraph">
        三十、本站會員與會員間不得有交換私人聯絡方式之行為，包括：手機號碼、地址、電子信箱、微信、ＬＩＮＥ、ＦＢ、ＩＧ、騰訊及其它任何之聯絡方式。若有交換聯絡方式之情事，本站有權終止兩方行為當事人之平台帳號。
      </div>
      <div class="paragraph">
        三一、本站有權終止未依契約、本站使用規範常規使用本平台，或濫用本平台服務之會員帳號。在此與各位會員解釋，本站會訂立此條約束，完全是希望妥善保護本站之所有會員得使用品質與權利，故所有會員只要正常使用本站，就無需擔心受到懲處。
      </div>
      <div class="paragraph">
        三二、若本站會員有違反本契約或本平台使用規範，而傷害到本站利益或使本站遭受損失，本站有權暫停或終止會員使用權限，且請求會員負損害賠償責任。在此提醒所有本站會員請保持且維護平台的優質環境，本站誠心的感謝所有會員的配合
      </div>
      <div class="paragraph">
        三三、本站保有冰山撞甜心平台使用規範之解釋權，若有爭議時本站有權主張本站之解釋條款內容之權利。若會員有任何意見應聯繫本站客服、官方ＬＩＮＥ，本站將誠心提供協助。
      </div>
      <div class="paragraph">
        三四、會員知悉且同意，其所透過本站所購買之白鑽等虛擬幣或其他任何形式之商品，均僅為本平台為服務目的所創設之虛擬機制，不具任何現金價值，並不構成會員財產之一部份，僅供會員依照本平台規則使用，會員不得轉讓、販賣或主張轉換為任何形式之財產。平台商城購買白鑽等虛擬幣後未使用部分須在二年內需使用完畢，逾期不得使用，會員亦不得主張退費。
      </div>
      <div class="paragraph">
        三五、本站依財政部之規定開立電子發票，會員應填具真實有效之電子郵件信箱，以利發票之開立。
      </div>
      <div class="paragraph">
        三六、本契約、本站所訂定規範，均構成契約內容，會員及本站應共同遵守。
      </div>
      <div class="paragraph">
        三七、本站（為鴻道資訊有限公司經營管理，以下稱本站）為維護您的個資安全性，重視您的隱私權益，謹遵守「個人資料保護法」（以下稱個資法）規範，告知您相關權益，並取得您同意本站搜集、處理及利用您所提供之個人資料：
        <div class="paragraph">
          一、搜集目的：本站基於各項服務、客戶管理、會員管理、公司經營、其他經營項目及營業登記項目或組織章程所定之業務，並為行銷、客戶管理、用戶管理、統計調查與分析、資訊與資料庫管理之目的，在個資法的規範下搜集、處理及利用您所提供之個人資料。
        </div>
        <div class="paragraph">
          二、個人資料之類別
          <ol class="ordered-list">
            <li>1、C001辨識個人者: 如消費者之姓名、職稱、工作地址、戶籍地址、住家地址、以前地址、住家電話號碼、即時通訊程式帳號、行動電話、網路平臺申請之帳號、通訊及戶籍地址、相片、電子郵遞地址、電子簽章、憑證卡序號、憑證序號、提供網路身分認證或申辦查詢服務之紀錄及其他任何可辨識資料本人者等。</li>
            <li>2、C002辨識財務者: 如金融機構帳戶之號碼與姓名等。</li>
            <li>3、C003政府資料中之辨識者: 如身分證統一編號、護照號碼等。</li>
            <li>5、C012身體描述: 如身高、體重、血型等。</li>
            <li>6、C013習慣: 如抽菸、喝酒等。</li>
            <li>7、C014個性: 如個性等評述意見。</li>
            <li>8、C021家庭情形: 如婚姻狀況、有無子女等。</li>
            <li>9、C023家庭其他成員之細節: 如子女、受扶養人、家庭其他成員或親屬、父母、同居人及居國外及大陸人民親屬等。</li>
            <li>10、C031住家及設施: 如住所地址、房屋之種類、價值及所有人之姓名等。</li>
            <li>11、C032財產: 如所有或具有其他權利之動產或不動產等。</li>
            <li>12、C034旅行及其他遷徙細節: 如過去之遷徙、旅行細節、外國護照、居留證明文件及工作證照及工作證等相關細節等。</li>
            <li>13、C035休閒活動及興趣: 如嗜好、運動及其他興趣等。</li>
            <li>14、C036生活格調: 如使用消費品之種類及服務之細節、個人或家庭之消費模式等。</li>
            <li>15、C038職業: 如各種職業等。</li>
            <li>16、C039執照或其他許可: 如駕駛執照、行車執照等。</li>
            <li>17、C051學校紀錄: 如大學、專科或其他學校等。</li>
            <li>18、C052資格或技術: 如學歷資格、專業技術、特別執照、政府職訓機構學習過程、國家考試、考試成績或其他訓練紀錄等。</li>
            <li>19、C054職業專長: 如專家、學者、顧問等。</li>
            <li>20、C056著作: 如書籍、文章、報告、視聽出版品及其他著作等。</li>
            <li>21、C061現行之受僱情形: 如工作職稱、工作描述、等級等。</li>
            <li>22、C068薪資與預扣款: 如薪水、工資等。</li>
            <li>23、C081收入、所得、資產與投資: 如總收入、總所得、資產、儲蓄等。</li>
            <li>24、C082負債與支出: 如支出總額、租金支出、貸款支出、本票等信用工具支出等。</li>
            <li>25、C083信用評等:如：信用等級、財務狀況與等級、收入狀況與等級等。</li>
            <li>26、C084貸款: 例如：貸款類別、貸款契約金額、貸款餘額、初貸日、到期日、應付利息、付款紀錄、擔保之細節等。</li>
          </ol>
        </div>
        <div class="paragraph">
          三、個人資料利用期間、地區、對象及方法
          <ol class="ordered-list">
            <li>1、期間：本站營運期間</li>
            <li>2、利用對象及方法：本站、本站關係企業、本站經營之網路平台會員及本站業務合作對象</li>
            <li>3、地區：您的資料將運用於冰山撞甜心（鴻道資訊有限公司）營運之地區。</li>
          </ol>
        </div>
        <div class="paragraph">
          四、 資料保密性與安全性
          本站對於所有會接觸到您個人資料之人都有嚴格規範，並符合法規要求，以保護您個人資料的安全。
        </div>
        <div class="paragraph">
          五、個人資料之權利
          <ol class="ordered-list">
            <li>1、查詢或請求閱覽。</li>
            <li>2、請求製給複製本。</li>
            <li>3、請求補充或更正。</li>
            <li>4、請求停止搜集、處理或利用。</li>
            <li>5、請求刪除。</li>
            <li>可聯繫本站進行申請。</li>
          </ol>
        </div>
      </div>
      <div class="paragraph">
        三八、本站與會員雙方之權利義務關係，悉依本合約及本站所訂其他規範辦理。未規定事項，依中華民國相關法令規定辦理。
      </div>
      <div class="paragraph">
        三九、如因本合約涉訴訟，雙方同意以台灣台北地方法院為第一審管轄法院。
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'

export default Vue.extend({
  layout: 'WithHeaderFooter',
  head: {
    title: '服務條款'
  }
})
</script>
